 

/*************	功能说明	**************

 

******************************************/
 
#include "rsystem.h"



//========================================================================
// 函数: void  delay_ms(unsigned char ms)
// 描述: 延时函数。
// 参数: ms,要延时的ms数, 这里只支持1~255ms. 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期:  
// 备注: 
//========================================================================
void  delay_ms(unsigned char ms)
{
     unsigned int i;
	 do{
	    i = MAIN_Fosc / 13000;
		  while(--i)	;   //14T per loop
     }while(--ms);
}
//========================================================================
// 函数: void  delay_s(unsigned char s)
// 描述: 延时函数。
// 参数: s,要延时的s数, 这里只支持1~255s. 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期:  
// 备注: 
//========================================================================

void  delay_s(unsigned char s){
   
     u8 temp=5*s ;
	 do{
	  delay_ms(200);
		 
     }while(--temp);
	


}